node {
  name: "INPUT/emb_placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "INPUT/onehot_placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 11
        }
      }
    }
  }
}
node {
  name: "INPUT/wide_placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "INPUT/label"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "d\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform/min"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.015625
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform/max"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.015625
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform/sub"
  op: "Sub"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/max"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/min"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform/mul"
  op: "Mul"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/RandomUniform"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/random_uniform"
  op: "Add"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/mul"
  input: "deep_logits/multiEmbedding/embedding/random_uniform/min"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/embeddingemb"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/embeddingemb/Assign"
  op: "Assign"
  input: "deep_logits/multiEmbedding/embedding/embeddingemb"
  input: "deep_logits/multiEmbedding/embedding/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding/embeddingemb"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding/embeddingemb/read"
  op: "Identity"
  input: "deep_logits/multiEmbedding/embedding/embeddingemb"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding/embeddingemb"
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "d\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform/min"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.015625
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform/max"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.015625
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform/sub"
  op: "Sub"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/max"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/min"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform/mul"
  op: "Mul"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/RandomUniform"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/random_uniform"
  op: "Add"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/mul"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform/min"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/embeddingemb"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/embeddingemb/Assign"
  op: "Assign"
  input: "deep_logits/multiEmbedding/embedding_1/embeddingemb"
  input: "deep_logits/multiEmbedding/embedding_1/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding_1/embeddingemb"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_1/embeddingemb/read"
  op: "Identity"
  input: "deep_logits/multiEmbedding/embedding_1/embeddingemb"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding_1/embeddingemb"
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "d\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform/min"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.015625
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform/max"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.015625
      }
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform/sub"
  op: "Sub"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/max"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/min"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform/mul"
  op: "Mul"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/RandomUniform"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/random_uniform"
  op: "Add"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/mul"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform/min"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/embeddingemb"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 100
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/embeddingemb/Assign"
  op: "Assign"
  input: "deep_logits/multiEmbedding/embedding_2/embeddingemb"
  input: "deep_logits/multiEmbedding/embedding_2/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding_2/embeddingemb"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "deep_logits/multiEmbedding/embedding_2/embeddingemb/read"
  op: "Identity"
  input: "deep_logits/multiEmbedding/embedding_2/embeddingemb"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding_2/embeddingemb"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice"
  op: "StridedSlice"
  input: "INPUT/emb_placeholder"
  input: "deep_logits/look_up_embedding/strided_slice/stack"
  input: "deep_logits/look_up_embedding/strided_slice/stack_1"
  input: "deep_logits/look_up_embedding/strided_slice/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/StringToHashBucketFast"
  op: "StringToHashBucketFast"
  input: "deep_logits/look_up_embedding/strided_slice"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 100
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/embedding_lookup"
  op: "Gather"
  input: "deep_logits/multiEmbedding/embedding/embeddingemb/read"
  input: "deep_logits/look_up_embedding/StringToHashBucketFast"
  device: "/device:GPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding/embeddingemb"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_1/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_1"
  op: "StridedSlice"
  input: "INPUT/emb_placeholder"
  input: "deep_logits/look_up_embedding/strided_slice_1/stack"
  input: "deep_logits/look_up_embedding/strided_slice_1/stack_1"
  input: "deep_logits/look_up_embedding/strided_slice_1/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/StringToHashBucketFast_1"
  op: "StringToHashBucketFast"
  input: "deep_logits/look_up_embedding/strided_slice_1"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 100
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/embedding_lookup_1"
  op: "Gather"
  input: "deep_logits/multiEmbedding/embedding_1/embeddingemb/read"
  input: "deep_logits/look_up_embedding/StringToHashBucketFast_1"
  device: "/device:GPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding_1/embeddingemb"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_2/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/strided_slice_2"
  op: "StridedSlice"
  input: "INPUT/emb_placeholder"
  input: "deep_logits/look_up_embedding/strided_slice_2/stack"
  input: "deep_logits/look_up_embedding/strided_slice_2/stack_1"
  input: "deep_logits/look_up_embedding/strided_slice_2/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/StringToHashBucketFast_2"
  op: "StringToHashBucketFast"
  input: "deep_logits/look_up_embedding/strided_slice_2"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 100
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/embedding_lookup_2"
  op: "Gather"
  input: "deep_logits/multiEmbedding/embedding_2/embeddingemb/read"
  input: "deep_logits/look_up_embedding/StringToHashBucketFast_2"
  device: "/device:GPU:0"
  attr {
    key: "Tindices"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@deep_logits/multiEmbedding/embedding_2/embeddingemb"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/concat/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "deep_logits/look_up_embedding/concat"
  op: "ConcatV2"
  input: "deep_logits/look_up_embedding/embedding_lookup"
  input: "deep_logits/look_up_embedding/embedding_lookup_1"
  input: "deep_logits/look_up_embedding/embedding_lookup_2"
  input: "deep_logits/look_up_embedding/concat/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice/stack"
  input: "deep_logits/get_onehot/strided_slice/stack_1"
  input: "deep_logits/get_onehot/strided_slice/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToHashBucketFast"
  op: "StringToHashBucketFast"
  input: "deep_logits/get_onehot/strided_slice"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 41
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 41
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToHashBucketFast"
  input: "deep_logits/get_onehot/one_hot/depth"
  input: "deep_logits/get_onehot/one_hot/on_value"
  input: "deep_logits/get_onehot/one_hot/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_1/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_1/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_1/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_1"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_1/stack"
  input: "deep_logits/get_onehot/strided_slice_1/stack_1"
  input: "deep_logits/get_onehot/strided_slice_1/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToHashBucketFast_1"
  op: "StringToHashBucketFast"
  input: "deep_logits/get_onehot/strided_slice_1"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 4
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_1/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_1/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_1/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_1"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToHashBucketFast_1"
  input: "deep_logits/get_onehot/one_hot_1/depth"
  input: "deep_logits/get_onehot/one_hot_1/on_value"
  input: "deep_logits/get_onehot/one_hot_1/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_2/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_2/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_2/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_2"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_2/stack"
  input: "deep_logits/get_onehot/strided_slice_2/stack_1"
  input: "deep_logits/get_onehot/strided_slice_2/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToHashBucketFast_2"
  op: "StringToHashBucketFast"
  input: "deep_logits/get_onehot/strided_slice_2"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 20
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_2/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_2/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_2/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_2"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToHashBucketFast_2"
  input: "deep_logits/get_onehot/one_hot_2/depth"
  input: "deep_logits/get_onehot/one_hot_2/on_value"
  input: "deep_logits/get_onehot/one_hot_2/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_3/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_3/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_3/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_3"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_3/stack"
  input: "deep_logits/get_onehot/strided_slice_3/stack_1"
  input: "deep_logits/get_onehot/strided_slice_3/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToHashBucketFast_3"
  op: "StringToHashBucketFast"
  input: "deep_logits/get_onehot/strided_slice_3"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 10
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_3/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_3/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_3/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_3"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToHashBucketFast_3"
  input: "deep_logits/get_onehot/one_hot_3/depth"
  input: "deep_logits/get_onehot/one_hot_3/on_value"
  input: "deep_logits/get_onehot/one_hot_3/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_4/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_4/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\005\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_4/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_4"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_4/stack"
  input: "deep_logits/get_onehot/strided_slice_4/stack_1"
  input: "deep_logits/get_onehot/strided_slice_4/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToNumber"
  op: "StringToNumber"
  input: "deep_logits/get_onehot/strided_slice_4"
  device: "/device:GPU:0"
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_4/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_4/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_4/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 24
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_4"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToNumber"
  input: "deep_logits/get_onehot/one_hot_4/depth"
  input: "deep_logits/get_onehot/one_hot_4/on_value"
  input: "deep_logits/get_onehot/one_hot_4/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_5/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\005\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_5/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\006\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_5/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_5"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_5/stack"
  input: "deep_logits/get_onehot/strided_slice_5/stack_1"
  input: "deep_logits/get_onehot/strided_slice_5/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToHashBucketFast_4"
  op: "StringToHashBucketFast"
  input: "deep_logits/get_onehot/strided_slice_5"
  device: "/device:GPU:0"
  attr {
    key: "num_buckets"
    value {
      i: 15
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_5/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_5/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_5/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 15
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_5"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToHashBucketFast_4"
  input: "deep_logits/get_onehot/one_hot_5/depth"
  input: "deep_logits/get_onehot/one_hot_5/on_value"
  input: "deep_logits/get_onehot/one_hot_5/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_6/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\006\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_6/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\007\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_6/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_6"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_6/stack"
  input: "deep_logits/get_onehot/strided_slice_6/stack_1"
  input: "deep_logits/get_onehot/strided_slice_6/stack_2"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "deep_logits/get_onehot/StringToNumber_1"
  op: "StringToNumber"
  input: "deep_logits/get_onehot/strided_slice_6"
  device: "/device:GPU:0"
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_6/on_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_6/off_value"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_6/depth"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/one_hot_6"
  op: "OneHot"
  input: "deep_logits/get_onehot/StringToNumber_1"
  input: "deep_logits/get_onehot/one_hot_6/depth"
  input: "deep_logits/get_onehot/one_hot_6/on_value"
  input: "deep_logits/get_onehot/one_hot_6/off_value"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_7/stack"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\007\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_7/stack_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_7/stack_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "deep_logits/get_onehot/strided_slice_7"
  op: "StridedSlice"
  input: "INPUT/onehot_placeholder"
  input: "deep_logits/get_onehot/strided_slice_7/stack"
  input: "deep_logits/get_onehot/strided_slice_7/stack_1"
  input: "deep_logits/get_onehot/strided_slice_7/stack_2"
